fuszenecker/ARM/ARM_STM32/Firmware/drivers/luminary/inc/lm3s5757.h
//*****************************************************************************
//
// General-Purpose Input/Outputs (PORTG)
//
//*****************************************************************************
#define GPIO_PORTG_DATA_BITS_R  ((volatile unsigned long *)0x40026000)
#define GPIO_PORTG_DATA_R       (*((volatile unsigned long *)0x400263FC))
#define GPIO_PORTG_DIR_R        (*((volatile unsigned long *)0x40026400))
#define GPIO_PORTG_IS_R         (*((volatile unsigned long *)0x40026404))
#define GPIO_PORTG_IBE_R        (*((volatile unsigned long *)0x40026408))
#define GPIO_PORTG_IEV_R        (*((volatile unsigned long *)0x4002640C))
#define GPIO_PORTG_IM_R         (*((volatile unsigned long *)0x40026410))
#define GPIO_PORTG_RIS_R        (*((volatile unsigned long *)0x40026414))
#define GPIO_PORTG_MIS_R        (*((volatile unsigned long *)0x40026418))
#define GPIO_PORTG_ICR_R        (*((volatile unsigned long *)0x4002641C))
#define GPIO_PORTG_AFSEL_R      (*((volatile unsigned long *)0x40026420))
#define GPIO_PORTG_DR2R_R       (*((volatile unsigned long *)0x40026500))
#define GPIO_PORTG_DR4R_R       (*((volatile unsigned long *)0x40026504))
#define GPIO_PORTG_DR8R_R       (*((volatile unsigned long *)0x40026508))
#define GPIO_PORTG_ODR_R        (*((volatile unsigned long *)0x4002650C))
#define GPIO_PORTG_PUR_R        (*((volatile unsigned long *)0x40026510))
#define GPIO_PORTG_PDR_R        (*((volatile unsigned long *)0x40026514))
#define GPIO_PORTG_SLR_R        (*((volatile unsigned long *)0x40026518))
#define GPIO_PORTG_DEN_R        (*((volatile unsigned long *)0x4002651C))
#define GPIO_PORTG_LOCK_R       (*((volatile unsigned long *)0x40026520))
#define GPIO_PORTG_CR_R         (*((volatile unsigned long *)0x40026524))
#define GPIO_PORTG_AMSEL_R      (*((volatile unsigned long *)0x40026528))

//*****************************************************************************
//
// General-Purpose Input/Outputs (PORTH)
//
//*****************************************************************************
#define GPIO_PORTH_DATA_BITS_R  ((volatile unsigned long *)0x40027000)
#define GPIO_PORTH_DATA_R       (*((volatile unsigned long *)0x400273FC))
#define GPIO_PORTH_DIR_R        (*((volatile unsigned long *)0x40027400))
#define GPIO_PORTH_IS_R         (*((volatile unsigned long *)0x40027404))
#define GPIO_PORTH_IBE_R        (*((volatile unsigned long *)0x40027408))
#define GPIO_PORTH_IEV_R        (*((volatile unsigned long *)0x4002740C))
#define GPIO_PORTH_IM_R         (*((volatile unsigned long *)0x40027410))
#define GPIO_PORTH_RIS_R        (*((volatile unsigned long *)0x40027414))
#define GPIO_PORTH_MIS_R        (*((volatile unsigned long *)0x40027418))
#define GPIO_PORTH_ICR_R        (*((volatile unsigned long *)0x4002741C))
#define GPIO_PORTH_AFSEL_R      (*((volatile unsigned long *)0x40027420))
#define GPIO_PORTH_DR2R_R       (*((volatile unsigned long *)0x40027500))
#define GPIO_PORTH_DR4R_R       (*((volatile unsigned long *)0x40027504))
#define GPIO_PORTH_DR8R_R       (*((volatile unsigned long *)0x40027508))
#define GPIO_PORTH_ODR_R        (*((volatile unsigned long *)0x4002750C))
#define GPIO_PORTH_PUR_R        (*((volatile unsigned long *)0x40027510))
#define GPIO_PORTH_PDR_R        (*((volatile unsigned long *)0x40027514))
#define GPIO_PORTH_SLR_R        (*((volatile unsigned long *)0x40027518))
#define GPIO_PORTH_DEN_R        (*((volatile unsigned long *)0x4002751C))
#define GPIO_PORTH_LOCK_R       (*((volatile unsigned long *)0x40027520))
#define GPIO_PORTH_CR_R         (*((volatile unsigned long *)0x40027524))
#define GPIO_PORTH_AMSEL_R      (*((volatile unsigned long *)0x40027528))

//*****************************************************************************
//
// General-Purpose Timers (TIMER0)
//
//*****************************************************************************
#define TIMER0_CFG_R            (*((volatile unsigned long *)0x40030000))
#define TIMER0_TAMR_R           (*((volatile unsigned long *)0x40030004))
#define TIMER0_TBMR_R           (*((volatile unsigned long *)0x40030008))
#define TIMER0_CTL_R            (*((volatile unsigned long *)0x4003000C))
#define TIMER0_IMR_R            (*((volatile unsigned long *)0x40030018))
#define TIMER0_RIS_R            (*((volatile unsigned long *)0x4003001C))
#define TIMER0_MIS_R            (*((volatile unsigned long *)0x40030020))
#define TIMER0_ICR_R            (*((volatile unsigned long *)0x40030024))
#define TIMER0_TAILR_R          (*((volatile unsigned long *)0x40030028))
#define TIMER0_TBILR_R          (*((volatile unsigned long *)0x4003002C))
#define TIMER0_TAMATCHR_R       (*((volatile unsigned long *)0x40030030))
#define TIMER0_TBMATCHR_R       (*((volatile unsigned long *)0x40030034))
#define TIMER0_TAPR_R           (*((volatile unsigned long *)0x40030038))
#define TIMER0_TBPR_R           (*((volatile unsigned long *)0x4003003C))
#define TIMER0_TAR_R            (*((volatile unsigned long *)0x40030048))
#define TIMER0_TBR_R            (*((volatile unsigned long *)0x4003004C))

//*****************************************************************************
//
// General-Purpose Timers (TIMER1)
//
//*****************************************************************************
#define TIMER1_CFG_R            (*((volatile unsigned long *)0x40031000))
#define TIMER1_TAMR_R           (*((volatile unsigned long *)0x40031004))
#define TIMER1_TBMR_R           (*((volatile unsigned long *)0x40031008))
#define TIMER1_CTL_R            (*((volatile unsigned long *)0x4003100C))
#define TIMER1_IMR_R            (*((volatile unsigned long *)0x40031018))
#define TIMER1_RIS_R            (*((volatile unsigned long *)0x4003101C))
#define TIMER1_MIS_R            (*((volatile unsigned long *)0x40031020))
#define TIMER1_ICR_R            (*((volatile unsigned long *)0x40031024))
#define TIMER1_TAILR_R          (*((volatile unsigned long *)0x40031028))
#define TIMER1_TBILR_R          (*((volatile unsigned long *)0x4003102C))
#define TIMER1_TAMATCHR_R       (*((volatile unsigned long *)0x40031030))
#define TIMER1_TBMATCHR_R       (*((volatile unsigned long *)0x40031034))
#define TIMER1_TAPR_R           (*((volatile unsigned long *)0x40031038))
#define TIMER1_TBPR_R           (*((volatile unsigned long *)0x4003103C))
#define TIMER1_TAR_R            (*((volatile unsigned long *)0x40031048))
#define TIMER1_TBR_R            (*((volatile unsigned long *)0x4003104C))

//*****************************************************************************
//
// General-Purpose Timers (TIMER2)
//
//*****************************************************************************
#define TIMER2_CFG_R            (*((volatile unsigned long *)0x40032000))
#define TIMER2_TAMR_R           (*((volatile unsigned long *)0x40032004))
#define TIMER2_TBMR_R           (*((volatile unsigned long *)0x40032008))
#define TIMER2_CTL_R            (*((volatile unsigned long *)0x4003200C))
#define TIMER2_IMR_R            (*((volatile unsigned long *)0x40032018))
#define TIMER2_RIS_R            (*((volatile unsigned long *)0x4003201C))
#define TIMER2_MIS_R            (*((volatile unsigned long *)0x40032020))
#define TIMER2_ICR_R            (*((volatile unsigned long *)0x40032024))
#define TIMER2_TAILR_R          (*((volatile unsigned long *)0x40032028))
#define TIMER2_TBILR_R          (*((volatile unsigned long *)0x4003202C))
#define TIMER2_TAMATCHR_R       (*((volatile unsigned long *)0x40032030))
#define TIMER2_TBMATCHR_R       (*((volatile unsigned long *)0x40032034))
#define TIMER2_TAPR_R           (*((volatile unsigned long *)0x40032038))
#define TIMER2_TBPR_R           (*((volatile unsigned long *)0x4003203C))
#define TIMER2_TAR_R            (*((volatile unsigned long *)0x40032048))
#define TIMER2_TBR_R            (*((volatile unsigned long *)0x4003204C))

//*****************************************************************************
//
// Analog-to-Digital Converter (ADC)
//
//*****************************************************************************
#define ADC_ACTSS_R             (*((volatile unsigned long *)0x40038000))
#define ADC_RIS_R               (*((volatile unsigned long *)0x40038004))
#define ADC_IM_R                (*((volatile unsigned long *)0x40038008))
#define ADC_ISC_R               (*((volatile unsigned long *)0x4003800C))
#define ADC_OSTAT_R             (*((volatile unsigned long *)0x40038010))
#define ADC_EMUX_R              (*((volatile unsigned long *)0x40038014))
#define ADC_USTAT_R             (*((volatile unsigned long *)0x40038018))
#define ADC_SSPRI_R             (*((volatile unsigned long *)0x40038020))
#define ADC_PSSI_R              (*((volatile unsigned long *)0x40038028))
#define ADC_SAC_R               (*((volatile unsigned long *)0x40038030))
#define ADC_SSMUX0_R            (*((volatile unsigned long *)0x40038040))
#define ADC_SSCTL0_R            (*((volatile unsigned long *)0x40038044))
#define ADC_SSFIFO0_R           (*((volatile unsigned long *)0x40038048))
#define ADC_SSFSTAT0_R          (*((volatile unsigned long *)0x4003804C))
#define ADC_SSMUX1_R            (*((volatile unsigned long *)0x40038060))
#define ADC_SSCTL1_R            (*((volatile unsigned long *)0x40038064))
#define ADC_SSFIFO1_R           (*((volatile unsigned long *)0x40038068))
#define ADC_SSFSTAT1_R          (*((volatile unsigned long *)0x4003806C))
#define ADC_SSMUX2_R            (*((volatile unsigned long *)0x40038080))
#define ADC_SSCTL2_R            (*((volatile unsigned long *)0x40038084))
#define ADC_SSFIFO2_R           (*((volatile unsigned long *)0x40038088))
#define ADC_SSFSTAT2_R          (*((volatile unsigned long *)0x4003808C))
#define ADC_SSMUX3_R            (*((volatile unsigned long *)0x400380A0))
#define ADC_SSCTL3_R            (*((volatile unsigned long *)0x400380A4))
#define ADC_SSFIFO3_R           (*((volatile unsigned long *)0x400380A8))
#define ADC_SSFSTAT3_R          (*((volatile unsigned long *)0x400380AC))

//*****************************************************************************
//
// Controller Area Network (CAN0) Module
//
//*****************************************************************************
#define CAN0_CTL_R              (*((volatile unsigned long *)0x40040000))
#define CAN0_STS_R              (*((volatile unsigned long *)0x40040004))
#define CAN0_ERR_R              (*((volatile unsigned long *)0x40040008))
#define CAN0_BIT_R              (*((volatile unsigned long *)0x4004000C))
#define CAN0_INT_R              (*((volatile unsigned long *)0x40040010))
#define CAN0_TST_R              (*((volatile unsigned long *)0x40040014))
#define CAN0_BRPE_R             (*((volatile unsigned long *)0x40040018))
#define CAN0_IF1CRQ_R           (*((volatile unsigned long *)0x40040020))
#define CAN0_IF1CMSK_R          (*((volatile unsigned long *)0x40040024))
#define CAN0_IF1MSK1_R          (*((volatile unsigned long *)0x40040028))
#define CAN0_IF1MSK2_R          (*((volatile unsigned long *)0x4004002C))
#define CAN0_IF1ARB1_R          (*((volatile unsigned long *)0x40040030))
#define CAN0_IF1ARB2_R          (*((volatile unsigned long *)0x40040034))
#define CAN0_IF1MCTL_R          (*((volatile unsigned long *)0x40040038))
#define CAN0_IF1DA1_R           (*((volatile unsigned long *)0x4004003C))
#define CAN0_IF1DA2_R           (*((volatile unsigned long *)0x40040040))
#define CAN0_IF1DB1_R           (*((volatile unsigned long *)0x40040044))
#define CAN0_IF1DB2_R           (*((volatile unsigned long *)0x40040048))
#define CAN0_IF2CRQ_R           (*((volatile unsigned long *)0x40040080))
#define CAN0_IF2CMSK_R          (*((volatile unsigned long *)0x40040084))
#define CAN0_IF2MSK1_R          (*((volatile unsigned long *)0x40040088))
#define CAN0_IF2MSK2_R          (*((volatile unsigned long *)0x4004008C))
#define CAN0_IF2ARB1_R          (*((volatile unsigned long *)0x40040090))
#define CAN0_IF2ARB2_R          (*((volatile unsigned long *)0x40040094))
#define CAN0_IF2MCTL_R          (*((volatile unsigned long *)0x40040098))
#define CAN0_IF2DA1_R           (*((volatile unsigned long *)0x4004009C))
#define CAN0_IF2DA2_R           (*((volatile unsigned long *)0x400400A0))
#define CAN0_IF2DB1_R           (*((volatile unsigned long *)0x400400A4))
#define CAN0_IF2DB2_R           (*((volatile unsigned long *)0x400400A8))
#define CAN0_TXRQ1_R            (*((volatile unsigned long *)0x40040100))
#define CAN0_TXRQ2_R            (*((volatile unsigned long *)0x40040104))
#define CAN0_NWDA1_R            (*((volatile unsigned long *)0x40040120))
#define CAN0_NWDA2_R            (*((volatile unsigned long *)0x40040124))
#define CAN0_MSG1INT_R          (*((volatile unsigned long *)0x40040140))
#define CAN0_MSG2INT_R          (*((volatile unsigned long *)0x40040144))
#define CAN0_MSG1VAL_R          (*((volatile unsigned long *)0x40040160))
#define CAN0_MSG2VAL_R          (*((volatile unsigned long *)0x40040164))

//*****************************************************************************
//
// Univeral Serial Bus (USB0) Controller
//
//*****************************************************************************
#define USB0_FADDR_R            (*((volatile unsigned long *)0x40050000))
#define USB0_POWER_R            (*((volatile unsigned long *)0x40050001))
#define USB0_TXIS_R             (*((volatile unsigned long *)0x40050002))
#define USB0_RXIS_R             (*((volatile unsigned long *)0x40050004))
#define USB0_TXIE_R             (*((volatile unsigned long *)0x40050006))
#define USB0_RXIE_R             (*((volatile unsigned long *)0x40050008))
#define USB0_IS_R               (*((volatile unsigned long *)0x4005000A))
#define USB0_IE_R               (*((volatile unsigned long *)0x4005000B))
#define USB0_FRAME_R            (*((volatile unsigned long *)0x4005000C))
#define USB0_EPIDX_R            (*((volatile unsigned long *)0x4005000E))
#define USB0_TEST_R             (*((volatile unsigned long *)0x4005000F))
#define USB0_FIFO0_R            (*((volatile unsigned long *)0x40050020))
#define USB0_FIFO1_R            (*((volatile unsigned long *)0x40050024))
#define USB0_FIFO2_R            (*((volatile unsigned long *)0x40050028))
#define USB0_FIFO3_R            (*((volatile unsigned long *)0x4005002C))
#define USB0_DEVCTL_R           (*((volatile unsigned long *)0x40050060))
#define USB0_TXFIFOSZ_R         (*((volatile unsigned long *)0x40050062))
#define USB0_RXFIFOSZ_R         (*((volatile unsigned long *)0x40050063))
#define USB0_TXFIFOADD_R        (*((volatile unsigned long *)0x40050064))
#define USB0_RXFIFOADD_R        (*((volatile unsigned long *)0x40050066))
#define USB0_CONTIM_R           (*((volatile unsigned long *)0x4005007A))
#define USB0_VPLEN_R            (*((volatile unsigned long *)0x4005007B))
#define USB0_FSEOF_R            (*((volatile unsigned long *)0x4005007D))
#define USB0_LSEOF_R            (*((volatile unsigned long *)0x4005007E))
#define USB0_TXFUNCADDR0_R      (*((volatile unsigned long *)0x40050080))
#define USB0_TXHUBADDR0_R       (*((volatile unsigned long *)0x40050082))
#define USB0_TXHUBPORT0_R       (*((volatile unsigned long *)0x40050083))
#define USB0_TXFUNCADDR1_R      (*((volatile unsigned long *)0x40050088))
#define USB0_TXHUBADDR1_R       (*((volatile unsigned long *)0x4005008A))
#define USB0_TXHUBPORT1_R       (*((volatile unsigned long *)0x4005008B))
#define USB0_RXFUNCADDR1_R      (*((volatile unsigned long *)0x4005008C))
#define USB0_RXHUBADDR1_R       (*((volatile unsigned long *)0x4005008E))
#define USB0_RXHUBPORT1_R       (*((volatile unsigned long *)0x4005008F))
#define USB0_TXFUNCADDR2_R      (*((volatile unsigned long *)0x40050090))
#define USB0_TXHUBADDR2_R       (*((volatile unsigned long *)0x40050092))
#define USB0_TXHUBPORT2_R       (*((volatile unsigned long *)0x40050093))
#define USB0_RXFUNCADDR2_R      (*((volatile unsigned long *)0x40050094))
#define USB0_RXHUBADDR2_R       (*((volatile unsigned long *)0x40050096))
#define USB0_RXHUBPORT2_R       (*((volatile unsigned long *)0x40050097))
#define USB0_TXFUNCADDR3_R      (*((volatile unsigned long *)0x40050098))
#define USB0_TXHUBADDR3_R       (*((volatile unsigned long *)0x4005009A))
#define USB0_TXHUBPORT3_R       (*((volatile unsigned long *)0x4005009B))
#define USB0_RXFUNCADDR3_R      (*((volatile unsigned long *)0x4005009C))
#define USB0_RXHUBADDR3_R       (*((volatile unsigned long *)0x4005009E))
#define USB0_RXHUBPORT3_R       (*((volatile unsigned long *)0x4005009F))
#define USB0_CSRL0_R            (*((volatile unsigned long *)0x40050102))
#define USB0_CSRH0_R            (*((volatile unsigned long *)0x40050103))
#define USB0_COUNT0_R           (*((volatile unsigned long *)0x40050108))
#define USB0_TYPE0_R            (*((volatile unsigned long *)0x4005010A))
#define USB0_NAKLMT_R           (*((volatile unsigned long *)0x4005010B))
#define USB0_TXMAXP1_R          (*((volatile unsigned long *)0x40050110))
#define USB0_TXCSRL1_R          (*((volatile unsigned long *)0x40050112))
#define USB0_TXCSRH1_R          (*((volatile unsigned long *)0x40050113))
#define USB0_RXMAXP1_R          (*((volatile unsigned long *)0x40050114))
#define USB0_RXCSRL1_R          (*((volatile unsigned long *)0x40050116))
#define USB0_RXCSRH1_R          (*((volatile unsigned long *)0x40050117))
#define USB0_RXCOUNT1_R         (*((volatile unsigned long *)0x40050118))
#define USB0_TXTYPE1_R          (*((volatile unsigned long *)0x4005011A))
#define USB0_TXINTERVAL1_R      (*((volatile unsigned long *)0x4005011B))
#define USB0_RXTYPE1_R          (*((volatile unsigned long *)0x4005011C))
#define USB0_RXINTERVAL1_R      (*((volatile unsigned long *)0x4005011D))
#define USB0_TXMAXP2_R          (*((volatile unsigned long *)0x40050120))
#define USB0_TXCSRL2_R          (*((volatile unsigned long *)0x40050122))
#define USB0_TXCSRH2_R          (*((volatile unsigned long *)0x40050123))
#define USB0_RXMAXP2_R          (*((volatile unsigned long *)0x40050124))
#define USB0_RXCSRL2_R          (*((volatile unsigned long *)0x40050126))
#define USB0_RXCSRH2_R          (*((volatile unsigned long *)0x40050127))
#define USB0_RXCOUNT2_R         (*((volatile unsigned long *)0x40050128))
#define USB0_TXTYPE2_R          (*((volatile unsigned long *)0x4005012A))
#define USB0_TXINTERVAL2_R      (*((volatile unsigned long *)0x4005012B))
#define USB0_RXTYPE2_R          (*((volatile unsigned long *)0x4005012C))
#define USB0_RXINTERVAL2_R      (*((volatile unsigned long *)0x4005012D))
#define USB0_TXMAXP3_R          (*((volatile unsigned long *)0x40050130))
#define USB0_TXCSRL3_R          (*((volatile unsigned long *)0x40050132))
#define USB0_TXCSRH3_R          (*((volatile unsigned long *)0x40050133))
#define USB0_RXMAXP3_R          (*((volatile unsigned long *)0x40050134))
#define USB0_RXCSRL3_R          (*((volatile unsigned long *)0x40050136))
#define USB0_RXCSRH3_R          (*((volatile unsigned long *)0x40050137))
#define USB0_RXCOUNT3_R         (*((volatile unsigned long *)0x40050138))
#define USB0_TXTYPE3_R          (*((volatile unsigned long *)0x4005013A))
#define USB0_TXINTERVAL3_R      (*((volatile unsigned long *)0x4005013B))
#define USB0_RXTYPE3_R          (*((volatile unsigned long *)0x4005013C))
#define USB0_RXINTERVAL3_R      (*((volatile unsigned long *)0x4005013D))
#define USB0_RQPKTCOUNT1_R      (*((volatile unsigned long *)0x40050304))
#define USB0_RQPKTCOUNT2_R      (*((volatile unsigned long *)0x40050308))
#define USB0_RQPKTCOUNT3_R      (*((volatile unsigned long *)0x4005030C))
#define USB0_RXDPKTBUFDIS_R     (*((volatile unsigned long *)0x40050340))
#define USB0_TXDPKTBUFDIS_R     (*((volatile unsigned long *)0x40050342))
#define USB0_EPC_R              (*((volatile unsigned long *)0x40050400))
#define USB0_EPCRIS_R           (*((volatile unsigned long *)0x40050404))
#define USB0_EPCIM_R            (*((volatile unsigned long *)0x40050408))
#define USB0_EPCISC_R           (*((volatile unsigned long *)0x4005040C))
#define USB0_DRRIS_R            (*((volatile unsigned long *)0x40050410))
#define USB0_DRIM_R             (*((volatile unsigned long *)0x40050414))
#define USB0_DRISC_R            (*((volatile unsigned long *)0x40050418))

//*****************************************************************************
//
// General-Purpose Input/Outputs (AHB)
//
//*****************************************************************************
#define GPIO_PORTA_AHB_DATA_BITS_R \
                                ((volatile unsigned long *)0x40058000)
#define GPIO_PORTA_AHB_DATA_R   (*((volatile unsigned long *)0x400583FC))
#define GPIO_PORTA_AHB_DIR_R    (*((volatile unsigned long *)0x40058400))
#define GPIO_PORTA_AHB_IS_R     (*((volatile unsigned long *)0x40058404))
#define GPIO_PORTA_AHB_IBE_R    (*((volatile unsigned long *)0x40058408))
#define GPIO_PORTA_AHB_IEV_R    (*((volatile unsigned long *)0x4005840C))
#define GPIO_PORTA_AHB_IM_R     (*((volatile unsigned long *)0x40058410))
#define GPIO_PORTA_AHB_RIS_R    (*((volatile unsigned long *)0x40058414))
#define GPIO_PORTA_AHB_MIS_R    (*((volatile unsigned long *)0x40058418))
#define GPIO_PORTA_AHB_ICR_R    (*((volatile unsigned long *)0x4005841C))
#define GPIO_PORTA_AHB_AFSEL_R  (*((volatile unsigned long *)0x40058420))
#define GPIO_PORTA_AHB_DR2R_R   (*((volatile unsigned long *)0x40058500))
#define GPIO_PORTA_AHB_DR4R_R   (*((volatile unsigned long *)0x40058504))
#define GPIO_PORTA_AHB_DR8R_R   (*((volatile unsigned long *)0x40058508))
#define GPIO_PORTA_AHB_ODR_R    (*((volatile unsigned long *)0x4005850C))
#define GPIO_PORTA_AHB_PUR_R    (*((volatile unsigned long *)0x40058510))
#define GPIO_PORTA_AHB_PDR_R    (*((volatile unsigned long *)0x40058514))
#define GPIO_PORTA_AHB_SLR_R    (*((volatile unsigned long *)0x40058518))
#define GPIO_PORTA_AHB_DEN_R    (*((volatile unsigned long *)0x4005851C))
#define GPIO_PORTA_AHB_LOCK_R   (*((volatile unsigned long *)0x40058520))
#define GPIO_PORTA_AHB_CR_R     (*((volatile unsigned long *)0x40058524))
#define GPIO_PORTA_AHB_AMSEL_R  (*((volatile unsigned long *)0x40058528))

